PlusRon/Firmware-STM32-SSD-Emulator/app/main.c
#include "stm32f072xb.h"
#include "gpio.h"
#include "systick.h"
#include "dma.h"
#include "usart.h"
#include "protocol.h"
#include "storage.h"

#define RX_BUF_SIZE 1024
__attribute__((aligned(4))) uint8_t rx_buffer[RX_BUF_SIZE];  
uint16_t rd_ptr = 0;             

void System_Init(void){
    RCC->APB2ENR |= (1UL << 14);   
    RCC->AHBENR  |= (1UL << 0);    
    GPIO_Init_Output(GPIOC, 6);    
    GPIO_Init_AF(GPIOA, 9, 1);     
    GPIO_Init_AF(GPIOA, 10, 1);    

    USART1->ICR |= 0xFFFFFFFF;

    DMA_Init(DMA1, 2, (uint32_t)&(USART1->RDR), (uint32_t)rx_buffer, RX_BUF_SIZE);
    UART_Init(USART1, 69);     
    *NVIC_ISER = (1UL << 27);  
    SysTick_Init(8000);        

    Storage_Init();
}

int main(void) {
    System_Init();

    uint32_t last_blink = 0;
    uint8_t led_state = 0;

    UART_Send(USART1, "\r\n--- NVMe 8KB Mode (50%% User Space) ---\r\n");

    while (1) {
        if (uart_overrun_occurred) {
            uart_overrun_occurred = 0;
            UART_Send(USART1, "[SYS] ORE_ERROR\r\n");
            DMA_Init(DMA1, 2, (uint32_t)&(USART1->RDR), (uint32_t)rx_buffer, RX_BUF_SIZE);
            rd_ptr = 0;
        }

        uint16_t wr_ptr = DMA_Get_Write_Index(DMA1, 2, RX_BUF_SIZE);

        if (rd_ptr != wr_ptr) {
            uint16_t available = (wr_ptr >= rd_ptr) ? (wr_ptr - rd_ptr) : (RX_BUF_SIZE - rd_ptr + wr_ptr);

            while (available >= PKT_SIZE) {
                if (rx_buffer[rd_ptr] == CMD_START_BYTE) {
                    Protocol_Parse(&rx_buffer[rd_ptr]);         
                    rd_ptr = (rd_ptr + PKT_SIZE) % RX_BUF_SIZE; 
                    available -= PKT_SIZE;
                } else {
                    rd_ptr = (rd_ptr + 1) % RX_BUF_SIZE;
                    available--;
                }
            }
        }

        if ((get_tick() - last_blink) >= 500) {
            LED_Toggle(GPIOC, 6, &led_state);
            last_blink = get_tick();
        }
    }
}
